{
  "srcctrl" : {
    "name": "Source Code Control Systems",
    "description": "Learn the tools and techniques needed to effectively and efficiently manage your projects source code. In this path you'll gain a working knowledge of Git, the source code control system GitHub is built around and one that is the industry standard used by many Open Source and commercial projects.",
    "courseIds": [
      "git",
      "github",
      "advancedgit"
    ],
    "goal": "Getting comfortable with git and GitHub in order to manage source code like a pro.",
    "version": "1.0.0"
  },
  "webpagedc" : {
    "name": "Webpage Design & Construction",
    "description": "Learn the technologies necessary to build simple webpages. In this path you'll become acquainted with CSS and HTML - the defacto standards for creating webpages.",
    "courseIds": [
      "buildwebpages"
    ],
    "goal": "Being able to build simple websites using CSS and HTML.",
    "version": "1.0.0"
  },
  "javascript" : {
    "name": "Javascript",
    "description": "Learn Javascript to start you on your way to becoming a Web Developer. Gain the skills needed to develop world-class Web Applications using the leading web development language - Javascript",
    "courseIds": [
      "beginnerjs",
      "intermediatejs",
      "advancedjs"
    ],
    "goal": "Having a thorough understanding of the Javascript language and its core concepts.",
    "version": "1.0.0"
  },
  "p1xt" : {
    "name": "The P1XT Guide",
    "description": "Follow the P1XT Guide to master the web development using CSS, HTML, Javascript, and a variety of major libraries. ",
    "courseIds": [
      "p1xtprereqs",
      "p1xttier1",
      "p1xttier2",
      "p1xttier3",
      "p1xttier4"
    ],
    "goal": "Becoming a proficient web developer and software engineer.",
    "salary": ["~ $65.000 / year", "(average, depending on location / experience)"],
    "version": "1.0.0"
  },
  "buildawebsite" : {
    "name": "Build A Website",
    "description": "Learn how to build a website using HTML, CSS, and key libraries including Sass, Less, and Stylus. ",
    "courseIds": [
      "htmlbasics",
      "cssbasics",
      "marryhtmlcss",
      "intermediatehtml",
      "intermediatecss",
      "advancedhtmlcss",
      "introbootstrap",
      "introfoundation",
      "introsass",
      "introless",
      "introstylus"
    ],
    "goal": "Being able to build even the most complex websites using HTML, CSS frameworks and preprocessors.",
    "version": "1.0.0"
  },
  "learnhowwebworks" : {
    "name": "Learn How the Web Works",
    "description": "Learn how the Internet and the World Wide Web work by mastering the fundamental technologies they are built on. Increase your knowledge of the hardware, software, and protocol that make up the Internet.",
    "courseIds": [
      "howwebworks",
      "getstartedweb"
    ],
    "goal": "Getting to know the fundamental building blocks of the world wide web.",
    "version": "1.0.0"
  }
}